app/controllers/api/benches_controller.rb

SELECT "benches".* FROM "benches" WHERE (lat < '37.809713098290686') AND (lat > '37.74187133792972') AND (lng > '-122.47791534423828') AND (lng < '-122.39208465576172')
---
  def index
    @benches = Bench.all

INSERT INTO "benches" ("description", "lat", "lng", "seating", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @bench = Bench.new(bench_params)

    if @bench.save